In [3]:
import numpy as np

In [4]:
import pandas as pd

In [5]:
d = {'one': pd.Series([1.,2.,3.], index=['a', 'b', 'c']),
     'two': pd.Series([1.,2.,3.,4.], index=['a','b','c', 'd'])}

df = pd.DataFrame(d)

df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [6]:
pd.DataFrame(d, index=['d','b','a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

In [7]:
pd.DataFrame(pd.Series(np.random.randn(5), name='something'))

   something
0  -0.345715
1  -0.598875
2  -0.555223
3   0.011849
4  -0.664201

In [8]:
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [9]:
df['three']= df['one'] * df['two']
df['flag'] = df['one'] > 2

In [10]:
df

   one  two  three   flag
a  1.0  1.0    1.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  4.0    NaN  False

In [29]:
del df['two']

In [11]:
df

   one  two  three   flag
a  1.0  1.0    1.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  4.0    NaN  False

In [12]:
df['foo'] = 'bar'

In [13]:
df

   one  two  three   flag  foo
a  1.0  1.0    1.0  False  bar
b  2.0  2.0    4.0  False  bar
c  3.0  3.0    9.0   True  bar
d  NaN  4.0    NaN  False  bar

In [14]:
dft = pd.DataFrame({'A': np.random.rand(3),
                        'B': 1,
                        'C': 'foo',
                        'D': pd.Timestamp('20010102'),
                        'E': pd.Series([1.0] * 3).astype('float32'),
                        'F': False,
                        'G': pd.Series([1] * 3, dtype='int8')})

In [15]:
dft

          A  B    C          D    E      F  G
0  0.083749  1  foo 2001-01-02  1.0  False  1
1  0.585378  1  foo 2001-01-02  1.0  False  1
2  0.856343  1  foo 2001-01-02  1.0  False  1

In [16]:
df1 = pd.DataFrame(np.random.randn(8, 1), columns=['A'], dtype='float32')

df1

          A
0  0.131462
1  0.776167
2 -0.053881
3  0.802358
4  0.686986
5 -1.222273
6  0.067733
7  0.745350

In [17]:
df1 = df1.astype('float64')

In [18]:
df1

          A
0  0.131462
1  0.776167
2 -0.053881
3  0.802358
4  0.686986
5 -1.222273
6  0.067733
7  0.745350

In [21]:
df1.dtypes

A    float64
dtype: object

In [24]:
df = pd.DataFrame(np.random.randn(8,3),
                  columns=['A', 'B', 'C'])

df.columns = [x.lower() for x in df.columns]
df

          a         b         c
0 -0.161337  0.682560 -0.077136
1  0.314387  0.072377 -1.582829
2  0.518220  0.045006  0.657775
3  0.293636 -2.158039  0.192915
4  0.363400 -0.048144  1.138846
5 -2.432535  0.132921  0.580017
6 -0.236891 -0.266434  0.069249
7  0.385302  0.410814 -0.169368

In [25]:
df['a'].array

<PandasArray>
[-0.16133686050736437,  0.31438658482070986,   0.5182199476952721,
   0.2936362216781605,  0.36339984594892677,  -2.4325345415588164,
 -0.23689094678570072,   0.3853016050649693]
Length: 8, dtype: float64

In [26]:
data = np.random.randint(0,7,size=50)

data

array([3, 3, 4, 3, 1, 6, 1, 1, 4, 0, 2, 3, 1, 3, 3, 6, 4, 6, 1, 1, 6, 3,
       4, 3, 5, 5, 6, 3, 1, 3, 1, 5, 1, 5, 3, 0, 1, 5, 0, 5, 3, 2, 6, 3,
       1, 2, 1, 3, 1, 2])

In [28]:
s = pd.Series(data)

s.value_counts()

3    14
1    13
6     6
5     6
4     4
2     4
0     3
dtype: int64

In [29]:
s.mode()

0    3
dtype: int64

In [30]:
s = pd.Series(pd.date_range('20130101 09:10:12', periods=4))

In [31]:
s.dt.hour

0    9
1    9
2    9
3    9
dtype: int64

In [32]:
s.dt.second

0    12
1    12
2    12
3    12
dtype: int64

In [33]:
s.dt.day

0    1
1    2
2    3
3    4
dtype: int64

In [34]:
s.dt.dayofweek

0    1
1    2
2    3
3    4
dtype: int64

In [46]:
first_json = pd.read_json('json.json')

first_json.head()

                                                   library
address                           123 Library St, Booktown
books    [{'title': 'The Great Gatsby', 'author': 'F. S...
name                                          City Library

In [47]:
first_json.to_json('json_columns.json', orient="columns")
first_json.to_json('json_index.json', orient="index")

In [51]:
g = pd.read_json('json_index.json')
g

,address,books,name
library,"123 Library St, Booktown","[{'title': 'The Great Gatsby', 'author': 'F. S...",City Library

In [53]:
import json
#load json object
with open('nested.json') as f:
    nested_json = json.load(f)
print(nested_json)
print(type(nested_json))

{'article': [{'id': '01', 'language': 'JSON', 'edition': 'first', 'author': 'Allen'}, {'id': '02', 'language': 'Python', 'edition': 'second', 'author': 'Aditya Sharma'}], 'blog': [{'name': 'Datacamp', 'URL': 'datacamp.com'}]}
<class 'dict'>

In [55]:
pd.json_normalize(nested_json)

,article,blog
0,"[{'id': '01', 'language': 'JSON', 'edition': '...","[{'name': 'Datacamp', 'URL': 'datacamp.com'}]"

In [56]:
nested_json

{'article': [{'id': '01',
   'language': 'JSON',
   'edition': 'first',
   'author': 'Allen'},
  {'id': '02',
   'language': 'Python',
   'edition': 'second',
   'author': 'Aditya Sharma'}],
 'blog': [{'name': 'Datacamp', 'URL': 'datacamp.com'}]}

In [60]:
blog = pd.json_normalize(nested_json, record_path='blog')
blog.head(5)

       name           URL
0  Datacamp  datacamp.com

In [65]:
article = pd.json_normalize(nested_json,record_path='article')

article.head(5)

In [66]:
data = [{"state": "Florida", 
        "shortname": "FL",
        "info": {"governor": "Rick Scott"},
        "counties": [{"name": "Dade", "population": 12345},
                     {"name": "Broward", "population": 40000},
                     {"name": "Palm Beach", "population": 60000}]},
       {"state": "Ohio",
        "shortname": "OH",
        "info": {"governor": "John Kasich"},
        "counties": [{"name": "Summit", "population": 1234},
                     {"name": "Cuyahoga", "population": 1337}]}]

In [68]:
pd.json_normalize(data)

,state,shortname,counties,info.governor
0,Florida,FL,"[{'name': 'Dade', 'population': 12345}, {'name...",Rick Scott
1,Ohio,OH,"[{'name': 'Summit', 'population': 1234}, {'nam...",John Kasich

In [70]:
pd.json_normalize(data=data, record_path='counties', meta=['state', 'shortname', ['info', 'governor']])

         name  population    state shortname info.governor
0        Dade       12345  Florida        FL    Rick Scott
1     Broward       40000  Florida        FL    Rick Scott
2  Palm Beach       60000  Florida        FL    Rick Scott
3      Summit        1234     Ohio        OH   John Kasich
4    Cuyahoga        1337     Ohio        OH   John Kasich